Repository: yeabsiradaniel/provider
Catalog: mobile/lib/l10n/app_*.arb
Languages: am

source: Language
am: ቋንቋ

# selectYourLanguage
source: Select Language
am: ቋንቋዎን ይምረጡ

source: Amharic
am: አማርኛ

# continueButton
source: CONTINUE
am: ቀጥል

# splashTitle
source: Service Link
am: አገልግሎት ሊንክ

# splashSubtitle
source: A premium marketplace that connects customers and service providers.
am: ደንበኞችን እና ባለሞያ የሚያገናኝ ፕሪሚየም የገበያ ቦታ።

source: Welcome
am: እንኳን ደህና መጡ

source: Customer
am: ደንበኛ

source: Provider
am: ባለሙያ

source: Phone
am: ስልክ

source: First Name
am: የመጀመሪያ ስም

source: Last Name
am: የአባት ስም

source: Pin
am: ሚስጥር ቁጥር

source: Profile Photo
am: የመገለጫ ፎቶ

source: ID Upload
am: መታወቂያ ይጫኑ

source: GET OTP
am: ኦቲፒ አግኝ

source: SENDING...
am: በመላክ ላይ...

source: Enter OTP
am: ኦቲፒ ያስገቡ

# otpSentTo
source: An OTP has been sent to {phoneNumber}
am: ኦቲፒ ወደ {phoneNumber} ተልኳል

source: VERIFY
am: አረጋግጥ

source: VERIFYING...
am: በማረጋገጥ ላይ...

# fieldRequired
source: This field is required
am: ይህ መስክ ያስፈልጋል

source: OTP must be 6 digits
am: ኦቲፒ 6 አሃዞች መሆን አለበት

# requiredForProviders
source: (Required for Providers only)
am: (ለባለሙያዎች ብቻ)

source: UPLOAD
am: ይጫኑ

# alreadyHaveAccount
source: Already have an account?
am: አካውንት አለዎት?

source: Login
am: ይግቡ

# dontHaveAccount
source: Don't have an account?
am: አካውንት የለዎትም?

source: Register
am: ይመዝገቡ

# registrationRequiredTitle
source: Registration Required
am: ምዝገባ ያስፈልጋል

# registrationRequiredMessage
source: It seems you do not have an account. Please register.
am: አካውንት የሌለዎት ይመስላል። እባክዎ ይመዝገቡ።

source: Cancel
am: ይቅር

# phoneMustBe9Digits
source: Phone number must be 9 digits
am: ስልክ ቁጥር 9 አሃዝ መሆን አለበት

source: PIN must be 6 digits
am: ፒን 6 አሃዝ መሆን አለበት

# userAlreadyExists
source: User already exists. Please log in.
am: ተጠቃሚው አስቀድሞ አለ። እባክዎ ይግቡ።

# invalidCredentials
source: Invalid PIN.
am: የተሳሳተ ፒን።

# otpExpiredOrInvalid
source: OTP expired or is invalid. Please request a new one.
am: ኦቲፒ ጊዜው አልፎበታል ወይም ልክ ያልሆነ ነው። እባክዎ አዲስ ይጠይቁ።

# otpTooManyAttempts
source: Too many incorrect attempts. Please request a new OTP.
am: በጣም ብዙ የተሳሳቱ ሙከራዎች። እባክዎ አዲስ ኦቲፒ ይጠይቁ።

source: Forgot PIN?
am: ፒን ረሱ?

source: Reset PIN
am: ፒን ዳግም አስጀምር

# confirmPin
source: Confirm New PIN
am: አዲስ ፒን ያረጋግጡ

source: PINs do not match
am: ፒን አይዛመዱም

source: RESETTING...
am: ዳግም በማስጀመር ላይ...

# genericError
source: An unexpected error occurred. Please try again.
am: ያልተጠበቀ ስህተት ተከስቷል። እባክዎ እንደገና ይሞክሩ።

source: Hello, Dawit
am: ሰላም ዳዊት

source: Search for experts...
am: ባለሙያዎችን ይፈልጉ...

source: Categories
am: ምድቦች

source: See All
am: ሁሉንም ይመልከቱ

source: Electric
am: ኤሌክትሪክ

source: Plumbing
am: ቧንቧ

source: Cleaning
am: ጽዳት

source: Repair
am: ጥገና

source: Bole, Addis Ababa
am: ቦሌ, አዲስ አበባ

# discountOff
source: {amount} ETB off
am: {amount} ብር ቅናሽ

source: on
am: ላይ

source: Electricians
am: የኤሌክትሪክ ባለሙያዎች

source: LIMITED TIME
am: ለተወሰነ ጊዜ

source: Bookings
am: የኔ ቀጠሮዎች

source: Upcoming
am: የሚመጣ

source: Completed
am: የተጠናቀቀ

source: Cancelled
am: የተሰረዘ

source: Chat
am: ቻት

source: Profile
am: መገለጫ

source: Edit Profile
am: መገለጫ ያርትዑ

source: Settings
am: ቅንብሮች

source: Payment Methods
am: የመክፈያ ዘዴዎች

source: Logout
am: ውጣ

source: VERIFIED
am: የተረጋገጠ

source: OFFLINE
am: ከመስመር ውጭ

source: Master Electrician
am: ዋና የኤሌክትሪክ ባለሙያ

source: YEARS EXP
am: የአገልግሎት ዘመን

source: RATING
am: ደረጃ

source: JOBS
am: ስራዎች

source: About
am: ስለ

source: Services
am: አገልግሎቶች

source: Quick Fix
am: ፈጣን ጥገና

source: Full Rewiring
am: ሙሉ ሽቦ መቀየር

source: Book Now
am: አሁን ይመዝገቡ

source: Request Details
am: የአገልግሎት ጥያቄ ዝርዝሮች

source: Problem Description
am: የችግር መግለጫ

# problemDescriptionHint
source: e.g. Wall socket sparking in the kitchen...
am: ለምሳሌ: በኩሽና ውስጥ ያለው ግድግዳ ሶኬት ብልጭታ ያሳያል...

source: Scheduled Time
am: የተያዘለት ሰዓት

source: Estimated Cost
am: ግምታዊ ወጪ

source: Service Fee
am: የአገልግሎት ክፍያ

source: Grand Total
am: ጠቅላላ ድምር

# confirmAndBook
source: CONFIRM & BOOK
am: አረጋግጥ እና አስይዝ

source: Online
am: ኦንላይን

source: Type message...
am: መልእክት ይጻፉ...

source: Provider Dashboard
am: የባለሙያ ዳሽቦርድ

source: Total Earnings (Month)
am: አጠቃላይ ወርሃዊ ገቢ

source: Avg Rating
am: አማካይ ደረጃ

source: Status
am: ሁኔታ

source: Incoming Requests
am: ገቢ ጥያቄዎች

source: Schedule
am: መርሃግብር

source: Earnings
am: ገቢዎች

source: Monthly Earnings
am: ወርሃዊ ገቢ

source: Recent Transactions
am: የቅርብ ጊዜ ግብይቶች

source: Withdrawal
am: ገንዘብ ማውጣት

source: Availability Settings
am: የመገኘት ቅንብሮች

source: Service History
am: የአገልግሎት ታሪክ

source: Home
am: ዋና ገጽ

source: Booking will appear here
am: የስራ ዝርዝሮች እዚህ ይታያሉ

source: Coming Soon!
am: በቅርቡ የሚመጣ!

source: Change Profile Photo
am: የመገለጫ ፎቶ ይቀይሩ

source: Update Profile
am: መገለጫ አዘምን

source: Dark Mode
am: ጨለማ ገጽታ

source: Enable Notifications
am: ማሳወቂያዎችን አንቃ

source: Select All
am: ሁሉንም ምረጥ

source: View Providers
am: ባለሙያዎችን ይመልከቱ

# helloUser
source: Hello, {firstName}
am: ሰላም, {firstName}

source: Select Your Services
am: አገልግሎቶችዎን ይምረጡ

source: Skip
am: ዝለል

source: Save
am: አስቀምጥ

source: Rate Provider
am: ባለሙያን ደረጃ ይስጡ

source: Available Providers
am: ያሉ ባለሙያዎች

source: No Providers Found
am: ምንም ባለሙያዎች አልተገኙም

source: Confirm Booking
am: ቦታ ማስያዝ ያረጋግጡ

source: Add a comment...
am: አስተያየት ያክሉ...

source: Submit Review
am: ግምገማ ያስገቡ

source: Accept
am: ተቀበል
